#include<stdio.h>
//#include<stdbool.h>
//平年和闰年每个月的天数
//之所以将一维写成13，是因为保证二维数组的下标与我们生活中的月份相对应，方便处理
int month[13][2] = { {0,0},{31,31},{28,29},{31,31},{30,30},{31,31},{30,30},{31,31},{31,31},{30,30},{31,31},{30,30},{31,31} };
 
bool isLeap(int year)
{
	return ((year % 4 == 0 && year % 100 != 0) || (year % 400 == 0));
}
 
int main()
{
	int time1, y1, m1, d1;
	int time2, y2, m2, d2;
	scanf("%d %d", &time1, &time2);
	if (time1 > time2)//设定time1早于time2，也就是说数字也它小，否则交换它们的值
	{
		int temp = time1;
		time1 = time2;
		time2 = temp;
	}
	y1 = time1 / 10000, m1 = time1 % 10000 / 100, d1 = time1 % 100;
	y2 = time2 / 10000, m2 = time2 % 10000 / 100, d2 = time2 % 100;
	int ans = 1;//记录结果,之所以初始值为1，为了满足“当两个日期是连续的，规定它们之间的天数是2天”这个条件
	//第一个日期没有达到第二个日期时进行循环
	//即!((y1 == y2)&&(m1 == m2)&&(d1 == d2))
	while (y1 < y2 || m1 < m2 || d1 < d2)
	{
		d1++;//天数加1
		if (d1 == month[m1][isLeap(y1)] + 1)//满当月天数
		{
			m1++;//日期变成下个月的1号
			d1 = 1;
		}
		if (m1 == 13)//月份满12个月
		{
			y1++;//日期变成下一年的1月
			m1 = 1;
		}
		ans++;//累计
	}
	printf("%d\n", ans);//输出结果
}